post/trace_dbg.org
TODO:
- перечитать
- spell check
- проверить ссылки
- опубликовать


* Отладка средствами trace/dbg/sys

Уж так устроена жизнь программиста, что в ней есть не только веселый и
интересный процесс написания нового кода, но и скучный, нудный процесс
отладки написанного.

И какие найдутся для этого средства? Да много их:
- отладка через логи в консоль или файл;
- debugger;
- trace/dbg;
- sys;
- библиотеки-обертки над все этим от третьих сторон.

Полагаю, что многие, как и я сам, хорошо знакомы с отладкой через
логи.  *lager*, *io:format* (вероятно обернутый в макрос или функцию)
-- вот они, друзья программиста :)

Такая отладка понятна, но не всегда удобна. Особенно в продакшн, где
по логам затруднительно наблюдать происходящее в реальном времени, а
приходится изучать постфактум. Ну об этом рассказывать не буду.

Имеется графический отладчик, [[http://www.erlang.org/doc/apps/debugger/debugger_chapter.html][debugger]]. Он менее известен.
Я вот и не пользовался ни разу. Но кому-то, наверное, полезен :)

Про debugger надо сказать, что он отлаживает один процесс, а в это
время остальные процессы живут своей жизнью. И, вероятно, пытаются
взаимодействовать с отлаживаемым процессом. Посылают сообщения,
ждут ответа. А отлаживаемый процесс как раз остановлен брейкпоинтом.

Понятно, что возможны всякие побочные эффекты, истекания таймаутов и т.д.
И понятно, что его не применишь в продакшен ноде.

Все это в том или ином виде есть в большинстве языков. А Erlang, кроме этого,
предлагает свои инструменты. Причем встроенные на самом низком уровне,
с низким влиянием на работу системы (с некоторыми оговорками),
и применимую для отладки в реальном времени на продакшене. Об этом и поговорим.

Тулы эти мощные, но довольно сложные в освоении. Конечно, есть документация.
Но лучше начать с более простых источников:

*trace/dbg* неплохо описаны в 17-й главе [[http://www.amazon.com/Erlang-Programming-Francesco-Cesarini/dp/0596518188]["Erlang Programming" Francesco Cesarini]]
и в 9 главе [[http://www.erlang-in-anger.com/]["Stuff Goes Bad. Erlang in Anger" Fred Hebert]].

У Цезарини более подробно и обстоятельно. У Фреда кратко и больше про *recon* --
его тулзу для мониторинга системы, и *recon_trace* -- обертку над dbg, кое-что
упрощающую и кое-что полезное добавляющую.


** erlang:trace, erlang:trace_pattern

Функции модуля *erlang*, низкоуровневый инструмент, который является основанием для других,
более удобных тулов. Присутствует в языке с первой версии.

Сами эти функции и работающий поверх них dbg на производительность вляют мало.
Но при трассировке могут генерироваться очень большое количество событий.
И если все они направляются на консоль, то во-первых, нагрузят io, и этим таки
повляют на систему. Во-вторых, сделают невозможным ввод с консоли.

Так что нужно быть осторожным, выбирая параметры трассировки. И использовать
более грамотные обертки, как *recon_trace* Фреда Хеберта.


*** erlang:trace(PidSpec, How, FlagList) -> integer()

http://www.erlang.org/doc/man/erlang.html#trace-3

У функции 3 аргумента.

*PidSpec* указывает, какие процессы мы хотим трассировать.
*How* это флаг, включающий или выключающий трассировку.
*FlagList* указывает, какие события на этих процессах мы хотим трассировать.

PidSpec имеет варианты:
- Pid процесса
- атомы: existing, new, all;

*existing* -- трассировать имеющиеся процессы, игнорировать новые, которые создаются уже после того,
как трассировка включена.
*new* -- наоборот, игнорировать имеющиеся процессы, трассировать новые.
*all* -- трассировать все процессы.

*FlagList* имеет много вариантов. Рассмотрим некоторые.

- send, 'receive' -- трассировать отправку/получение сообщений
- procs -- трассировать события жизненного цикла процесса и связи между процессами:
           spawn, exit,
           link, unlink, getting_linked, getting_unlinked,
           register, unregister
- call -- трассировать вызовы функций (подробности ниже)
- running -- трассировать работу планировщика процессов
- garbage_collection -- трассировать сборку мусора

Когда включена трассировка, генерируются специальные сообщения вида:
{trace, Pid, EventTag, Data1 [,Data2]}

Например:
{trace, Pid, 'receive', Msg} - процесс Pid получил сообщение Msg
{trace, Pid, send, Msg, To} - процесс Pid отправил сообщение Msg процессу To
{trace, Pid, call, {M, F, Args}} - процесс Pid начал выполнение функции {M, F, Args}
и т.д.

Кто получает эти сообщения? По умолчанию тот процесс, который вызвал *erlang:trace*
Но можно при вызове указать FlagList аргумент {tracer, Pid}, и сделать получателем
сообщений какой-нибудь другой процесс.

Процесс-получатель называется *tracer process*, и он может быть только один.
По понятным причинам, для него самого трассировку включить нельзя.

TODO: примеры в консоли


*** erlang:trace_pattern(MFA, MatchSpec, FlagList) -> integer()

http://www.erlang.org/doc/man/erlang.html#trace_pattern-3

Итак, мы теперь можем выбрать, какие процессы хотим трассировать.
Но обычно нам интересно наблюдать вызовы функций, аргументы
и возвращаемые значения.

Для этого нужно вызвать еще и erlang:trace_pattern/3.

И мы будем получать события трассировки, когда заданные в *erlang:trace*
процессы будут вызывать заданные в *erlang:trace_pattern* функции.

Тут аргументы посложнее :)

Первый аргумент MFA указывает функцию, которую мы хотим трассировать.
Это кортеж *{Module, Function, Arity}*, который однозначно указывает
функцию. Но он допускает wildcards, и так может указывать на несколько
функций:
{Module, Function, '_'} -- все функции с таким именем и любым Arity;
{Module, '_', '_'} -- все функции данного модуля;
{'_', '_', '_'} -- вообще все функции.

Второй аргумент, MatchSpec, сложнее.

Во-первых, он используется для включения-выключения трассировки (как и в erlang:trace)
если задать значения true/false.

Во-вторых, может управлять счетчиками вызовов функций,
и счетчиками времени выполнения функций. Подробности в документации.

И, наконец, можно задать собственно *match specification*, чтобы
событие трассировки генерировалось не для любого вызова функции,
а в зависимости от аргументов. Подробности ниже.

Третий аргумент, TraceFlags, добавляет еще некоторые опции:

global -- трассировать только глобальные вызовы;
local -- трассировать любые вызовы (и глобальные и локальные)

Глобальный вызов, это вызов экспортированной функции с указанием модуля:
my_module:my_func(Arg).

А вот это локальный вызов:
my_func(Arg).

call_count -- включает счетчик вызовов функции;
call_time -- добавляет время выполнения функции в событие трассировки.

TODO: примеры в консоли


