post/trace_dbg.html
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>Отладка средствами trace/dbg/sys</title>
    <link rel="stylesheet" type="text/css" href="/css/bootstrap.min.css" />
    <link rel="stylesheet" type="text/css" href="/css/main.css" />
  </head>
<body>

  <div id="header">
    <div id="main_title">
      <a href="/" style="color:#013;">Про Erlang и про всякое</a>
    </div>
    <div id="profile_link">
      <a href="https://plus.google.com/u/0/+YuriZhloba/about" style="color:#013;">Юра Жлоба</a>
    </div>
  </div>

<div id="content">
<h1>Отладка средствами trace/dbg/sys</h1>
<p><i>11 октября 2014</i><p>

<div id="table-of-contents">
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1-1">erlang:trace, erlang:trace_pattern</a>
<li><a href="#sec-1-2">dbg</a>
<li><a href="#sec-1-3">Перенаправление событий трассировки</a>
<li><a href="#sec-1-4">Match Specifications</a></li>
<li><a href="#sec-1-5">sys</a></li>
<li><a href="#sec-1-6">recon</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<div class="outline-text-2" id="text-1">
<p>
Уж так устроена жизнь программиста, что в ней есть не только веселый и
интересный процесс написания нового кода, но и скучный, нудный процесс
отладки написанного.
</p>

<p>
И какие найдутся для этого средства? Да много их:
</p>
<ul class="org-ul">
<li>отладка через логи в консоль или файл;
</li>
<li>debugger;
</li>
<li>trace/dbg;
</li>
<li>sys;
</li>
<li>библиотеки-обертки над все этим от третьих сторон.
</li>
</ul>

<p>
Полагаю, что многие, как и я сам, хорошо знакомы с отладкой через
логи.  <b>lager</b>, <b>io:format</b> (вероятно обернутый в макрос или функцию)
&#x2013; вот они, друзья программиста :)
</p>

<p>
Такая отладка понятна, но не всегда удобна. Особенно в продакшн, где
по логам затруднительно наблюдать происходящее в реальном времени, а
приходится изучать постфактум. Ну об этом рассказывать не буду.
</p>

<p>
Имеется графический отладчик, <a href="http://www.erlang.org/doc/apps/debugger/debugger_chapter.html">debugger</a>. Он менее известен.
Я вот и не пользовался ни разу. Но кому-то, наверное, полезен :)
</p>

<p>
Про debugger надо сказать, что он отлаживает один процесс, а в это
время остальные процессы живут своей жизнью. И, вероятно, пытаются
взаимодействовать с отлаживаемым процессом. Посылают сообщения,
ждут ответа. А отлаживаемый процесс как раз остановлен брейкпоинтом.
</p>

<p>
Понятно, что возможны всякие побочные эффекты, истекания таймаутов и т.д.
И понятно, что его не применишь в продакшен ноде.
</p>

<p>
Все это в том или ином виде есть в большинстве языков. А Erlang, кроме этого,
предлагает свои инструменты. Причем встроенные на самом низком уровне,
с низким влиянием на работу системы (с некоторыми оговорками),
и применимую для отладки в реальном времени на продакшене. Об этом и поговорим.
</p>

<p>
Тулы эти мощные, но довольно сложные в освоении. Конечно, есть документация.
Но лучше начать с более простых источников:
</p>

<p>
<b>trace/dbg</b> неплохо описаны в 17-й главе <a href="http://www.amazon.com/Erlang-Programming-Francesco-Cesarini/dp/0596518188">"Erlang Programming" Francesco Cesarini</a>
и в 9-й главе <a href="http://www.erlang-in-anger.com/">"Stuff Goes Bad. Erlang in Anger" Fred Hebert</a>.
</p>

<p>
У Цезарини более подробно и обстоятельно. У Фреда кратко и больше про <b>recon</b> &#x2013;
его тулзу для мониторинга системы, и <b>recon_trace</b> &#x2013; обертку над dbg, кое-что
упрощающую и кое-что полезное добавляющую.
</p>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">erlang:trace, erlang:trace_pattern</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Функции модуля <b>erlang</b>, низкоуровневый инструмент, который является основанием для других,
более удобных тулов. Присутствует в языке с первой версии.
</p>

<p>
Сами эти функции и работающий поверх них dbg на производительность влияют мало.
Но при трассировке могут генерироваться очень большое количество событий.
И если все они направляются на консоль, то во-первых, нагрузят io, и этим таки
повлияют на систему. Во-вторых, сделают невозможным ввод с консоли.
</p>

<p>
Так что нужно быть осторожным, выбирая параметры трассировки. И использовать
более грамотные обертки, как <b>recon_trace</b> Фреда Хеберта.
</p>
</div>


<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">erlang:trace(PidSpec, How, FlagList) -&gt; integer()</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="http://www.erlang.org/doc/man/erlang.html#trace-3">http://www.erlang.org/doc/man/erlang.html#trace-3</a>
</p>

<p>
У функции 3 аргумента.
</p>

<p>
<b>PidSpec</b> указывает, какие процессы мы хотим трассировать.
<b>How</b> это флаг, включающий или выключающий трассировку.
<b>FlagList</b> указывает, какие события на этих процессах мы хотим трассировать.
</p>

<p>
PidSpec имеет варианты:
</p>
<ul class="org-ul">
<li>Pid процесса
</li>
<li>атомы: existing, new, all;
</li>
</ul>

<p>
<b>existing</b> &#x2013; трассировать имеющиеся процессы, игнорировать новые, которые создаются уже после того,
как трассировка включена.
<b>new</b> &#x2013; наоборот, игнорировать имеющиеся процессы, трассировать новые.
<b>all</b> &#x2013; трассировать все процессы.
</p>

<p>
<b>FlagList</b> имеет много вариантов. Рассмотрим некоторые.
</p>

<ul class="org-ul">
<li>send, 'receive' &#x2013; трассировать отправку/получение сообщений
</li>
<li>procs &#x2013; трассировать события жизненного цикла процесса и связи между процессами:
spawn, exit,
link, unlink, getting_linked, getting_unlinked,
register, unregister
</li>
<li>call &#x2013; трассировать вызовы функций (подробности ниже)
</li>
<li>running &#x2013; трассировать работу планировщика процессов
</li>
<li>garbage_collection &#x2013; трассировать сборку мусора
</li>
</ul>

<p>
Когда включена трассировка, генерируются специальные сообщения вида:<br/>
{trace, Pid, EventTag, Data1 [,Data2]}
</p>

<p>
Например:<br/>
{trace, Pid, 'receive', Msg} - процесс Pid получил сообщение Msg<br/>
{trace, Pid, send, Msg, To} - процесс Pid отправил сообщение Msg процессу To<br/>
{trace, Pid, call, {M, F, Args}} - процесс Pid начал выполнение функции {M, F, Args}<br/>
и т.д.
</p>

<p>
Кто получает эти сообщения? По умолчанию тот процесс, который вызвал <b>erlang:trace</b>.
Но можно при вызове указать в FlagList аргумент {tracer, Pid}, и сделать получателем
сообщений какой-нибудь другой процесс.
</p>

<p>
Процесс-получатель называется <b>tracer process</b>, и он может быть только один.
По понятным причинам, для него самого трассировку включить нельзя.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">erlang:trace_pattern(MFA, MatchSpec, FlagList) -&gt; integer()</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="http://www.erlang.org/doc/man/erlang.html#trace_pattern-3">http://www.erlang.org/doc/man/erlang.html#trace_pattern-3</a>
</p>

<p>
Итак, мы теперь можем выбрать, какие процессы хотим трассировать.
Но обычно нам интересно наблюдать вызовы функций, аргументы
и возвращаемые значения.
</p>

<p>
Для этого нужно вызвать еще и erlang:trace_pattern/3.
</p>

<p>
И мы будем получать события трассировки, когда заданные в <b>erlang:trace</b>
процессы будут вызывать заданные в <b>erlang:trace_pattern</b> функции.
</p>

<p>
Тут аргументы посложнее :)
</p>

<p>
Первый аргумент MFA указывает функцию, которую мы хотим трассировать.
Это кортеж <b>{Module, Function, Arity}</b>, который однозначно указывает
функцию. Но он допускает wildcards, и так может указывать на несколько
функций:
<ul>
<li>{Module, Function, '_'} &#x2013; все функции с таким именем и любым Arity;</li>
<li>{Module, '_', '_'} &#x2013; все функции данного модуля;</li>
<li>{'_', '_', '_'} &#x2013; вообще все функции.</li>
</ul>
</p>

<p>
Второй аргумент, MatchSpec, сложнее.
</p>

<p>
Во-первых, он используется для включения-выключения трассировки (как и в erlang:trace)
если задать значения true/false.
</p>

<p>
Во-вторых, может управлять счетчиками вызовов функций,
и счетчиками времени выполнения функций. Подробности в документации.
</p>

<p>
И, наконец, можно задать собственно <b>match specification</b>, чтобы
событие трассировки генерировалось не для любого вызова функции,
а в зависимости от аргументов. Подробности ниже.
</p>

<p>
Третий аргумент, TraceFlags, добавляет еще некоторые опции:
<ul>
<li>global &#x2013; трассировать только глобальные вызовы;</li>
<li>local &#x2013; трассировать любые вызовы (и глобальные и локальные)</li>
<li>call_count &#x2013; включает счетчик вызовов функции;</li>
<li>call_time &#x2013; добавляет время выполнения функции в событие трассировки.</li>
</ul>
</p>

<p>
Глобальный вызов, это вызов экспортированной функции с указанием модуля:<br/>
my_module:my_func(Arg).
</p>

<p>
А вот это локальный вызов:<br/>
my_func(Arg).
</p>

</div>
</div>
</div>
