post/trace_dbg.org
** dbg

Как видно, *erlang:trace* и *erlang:trace_pattern* хоть и мощные, но не удобные
в использовании. Придется печатать много букв в консоли, чтобы управлять трассировкой
с их помощью. Модуль *dbg* делает такое управление более удобным и лаконичным.

http://www.erlang.org/doc/man/dbg.html

У Цезарини читаем:

Small impact on system performance, making it a suitable candidate for
tracing large live systems.

У Хеберта читаем:

Its interface is a bit clunky in terms of usability, but it’s entirely
good enough to do what you need. The problem with it is that you have
to know what you’re doing, because dbg can log absolutely everything
on the node and kill one in under two seconds.

Так что трейсить большие продакшен системы конечно можно, и нужно. Но с осторожностью :)

В документации мы видим целую пачку функций с короткими непонятными названиями:
dbg:p/2, dbg:p/3, dbg:tp/2 и т.д. Все они обертки, задающие те или иные аргументы
для erlang:trace, erlang:trace_pattern. А короткие они для того, чтобы их быстро
набирать в консоли.

Рассмотрим некоторые из них.

*** dbg:p(PidSpec, FlagLists) -> {ok, MatchDesc} | {error, term()}

PidSpec имеет варианты:
- Pid процесса в разных формах (собственно Pid, кортеж {N, N, N}, строка "<N.N.N>");
- имя, под которым процесс зарегистрирован;
- атомы: existing, new, all;

FlagLists принимает аналогичные значения, как в erlang:trace, но в лаконичном виде:
- *s* (send), *r* (received), *m* (message = send + receive)
- *p* (procs) события spawn, exit, link, unlink, getting_linked, getting_unlinked, register, unregister
- *c* (call)

Таким образом вызов:

dbg:p({0.55.0}, m)

аналогичен вызову:

erlang:trace({0.55.0}, true, [send, 'receive'])


*** dbg:c(Mod, Fun, Args, FlagList)

Оберкта для *erlang:trace_pattern*, выполняет:

erlang:trace_pattern({Mod, Fun, Args}, true, FlagList),
apply(Mod, Fun, Args),

То есть, задает trace_pattern для функции, и тут же ее вызвает.
Удобный способ, чтобы быстро отладить конкретную функцию.

Причем вызов *dbg:c* должен идти в паре с вызовом *dbg:p*,
так же, как в паре идут *erlang:trace* и *erlang:trace_pattern*

Есть вариант *dbg:c(Mod, Fun, Args)*, без указания FlagList. В этом случае
автоматически устанавливаются все флаги.


*** dbg:tp/2,3,4, dbg:tpl/2,3,4

Тоже обертка для *erlang:trace_pattern*, в нескольких вариантах. Позволяет задать MatchSpec.

*dbg:tp* ставит флаг global, и трассирует глобальные вызовы.
*dbg:tpl* ставит флаг local, и трассирует все вызовы.

Аргументы:

dbg:tp(Module,MatchSpec)
тоже самое, что
erlang:trace_pattern({Module, '_', '_'}, MatchSpec, [])

dbg:tp(Module,Function,MatchSpec)
тоже самое, что
erlang:trace_pattern({Module, Function, '_'}, MatchSpec, [])

dbg:tp(Module, Function, Arity, MatchSpec)
тоже самое, что
erlang:trace_pattern({Module, Function, Arity}, MatchSpec, [])


*** dbg:ctp/0,1,2,3, dbg:ctpg/0,1,2,3, dbg:ctpl/0,1,2,3

Эти функции останавливают трассировку, запущенную предыдущими функциями:
- dbg:ctpg останавливает, если запущено через dbg:tp
- dbg:ctpl останавливает, если запущено через dbg:tpl
- dbg:ctp останавливает, неважно как запущено

Да, с остановкой трассировки намудрили. Мало того, что нужно совпать по аргументам,
так еще нужно помнить, какой функцией трассировка запускалась :)


*** dbg:stop/0, dbg:stop_clean/0

Вышеуказанные функции останавливают трассировку, но не отменяют установленные флаги.

*dbg:stop* останавливает все трассировки, сбрасывает все флаги, закрывает порты
(если был редирект событий трассировки в порты). Но не сбрасывает MatchSpec.
То есть, отменяет *erlang:trace* но не отменяет *erlang:trace_pattern*

*dbg:stop_clear* тоже самое, плюс отменяет *erlang:trace_pattern*

TODO: примеры в консоли


** Перенаправление событий трассировки

По умолчанию события трассировки получает *tracer process*. Он их форматирует и выводит на консоль.
Но их можно перенаправить в кастомную функцию, в файл, или на другую ноду.

*** В кастомную функцию

*dbg:tracer(process , {HandlerFun, Data})*

Так можно задать кастомную функцию. Она должна получать 2 аргумента -- событие трассировки
и аккумулятор. Аргумент *Data* -- начальное значение аккумулятора. Функция возвращает
новое значение аккумулятора.

Таким образом можно организовать накопление некоторых данных в
аккумуляторе. Что может пригодится, например, для анализа работы
сборщика мусора, если трассируются события, связанный с его работой.

*** В файл

Сперва нужно получить ссылку на port function.

PortFun = dbg:trace_port(file, FileOptions)

*FileOptions* могут быть разными (см документацию).
Например *{FileName, wrap, FileSuffix}* задает ротацию в файлах, аналогично, как ротируются логи.

Затем вызваем

dbg:tracer(port, PortFun)


*** На другую ноду

Направить события в порт несколько сложнее. Сперва нужно получить ссылку на port function.

PortFun = dbg:trace_port(ip, Port)

Где *Port* -- это номер порта или кортеж *{PortNumber, QueueSize}*.

Затем вызваем

dbg:tracer(port, PortFun)

Опция *QueueSize* позволяет ограничить количество сообщений, которые хранятся в буфере.
Это полезно, если клиент не успевает их забирать. Лишние события будут просто игнорироваться.

На другой ноде нужно вызывать

dbg:trace_client(ip, Arg, {HandlerFun, Data})

Где *Arg* это номер порта или кортеж *{HostName, PortNumber}*

Такой клиент будет получать события из порта и обрабатывать их кастомной функцией.


