post/trace_dbg.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">dbg</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Как видно, <b>erlang:trace</b> и <b>erlang:trace_pattern</b> хоть и мощные, но не удобные
в использовании. Придется печатать много букв в консоли, чтобы управлять трассировкой
с их помощью. Модуль <b>dbg</b> делает такое управление более удобным и лаконичным.
</p>

<p>
<a href="http://www.erlang.org/doc/man/dbg.html">http://www.erlang.org/doc/man/dbg.html</a>
</p>

<p>
У Цезарини читаем:
</p>

<blockquote><p>
Small impact on system performance, making it a suitable candidate for
tracing large live systems.
</p></blockquote>

<p>
У Хеберта читаем:
</p>

<blockquote></p>
Its interface is a bit clunky in terms of usability, but it’s entirely
good enough to do what you need. The problem with it is that you have
to know what you’re doing, because dbg can log absolutely everything
on the node and kill one in under two seconds.
</p></blockquote>

<p>
Так что трейсить большие продакшен системы конечно можно, и нужно. Но с осторожностью :)
</p>

<p>
В документации мы видим целую пачку функций с короткими непонятными названиями:
dbg:p/2, dbg:p/3, dbg:tp/2 и т.д. Все они обертки, задающие те или иные аргументы
для erlang:trace, erlang:trace_pattern. А короткие они для того, чтобы их быстро
набирать в консоли.
</p>

<p>
Рассмотрим некоторые из них.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">dbg:p(PidSpec, FlagLists) -&gt; {ok, MatchDesc} | {error, term()}</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
PidSpec имеет варианты:
</p>
<ul class="org-ul">
<li>Pid процесса в разных формах (собственно Pid, кортеж {N, N, N}, строка "&lt;N.N.N&gt;");
</li>
<li>имя, под которым процесс зарегистрирован;
</li>
<li>атомы: existing, new, all;
</li>
</ul>

<p>
FlagLists принимает аналогичные значения, как в erlang:trace, но в лаконичном виде:
</p>
<ul class="org-ul">
<li><b>s</b> (send), <b>r</b> (received), <b>m</b> (message = send + receive)
</li>
<li><b>p</b> (procs) события spawn, exit, link, unlink, getting_linked, getting_unlinked, register, unregister
</li>
<li><b>c</b> (call)
</li>
</ul>

<p>
Таким образом вызов:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:p({0.55.0}, m)
</pre>
</div>

<p>
аналогичен вызову:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">erlang:trace({0.55.0}, [true], [send, 'receive'])
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">dbg:c(Mod, Fun, Args, FlagList)</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Оберкта для <b>erlang:trace_pattern</b>, выполняет:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">erlang:trace_pattern({Mod, Fun, Args}, true, FlagList),
apply(Mod, Fun, Args),
</pre>
</div>

<p>
То есть, задает trace_pattern для функции, и тут же ее вызывает.
Удобный способ, чтобы быстро отладить конкретную функцию.
</p>

<p>
Причем вызов <b>dbg:c</b> должен идти в паре с вызовом <b>dbg:p</b>,
так же, как в паре идут <b>erlang:trace</b> и <b>erlang:trace_pattern</b>
</p>

<p>
Есть вариант <b>dbg:c(Mod, Fun, Args)</b>, без указания FlagList. В этом случае
автоматически устанавливаются все флаги.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">dbg:tp/2,3,4, dbg:tpl/2,3,4</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Тоже обертка для <b>erlang:trace_pattern</b>, в нескольких вариантах. Позволяет задать MatchSpec.
</p>

<p>
<b>dbg:tp</b> ставит флаг global, и трассирует глобальные вызовы.
<b>dbg:tpl</b> ставит флаг local, и трассирует все вызовы.
</p>

<p>
Аргументы:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:tp(Module, MatchSpec)
// тоже самое, что
erlang:trace_pattern({Module, '_', '_'}, MatchSpec, [])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:tp(Module, Function, MatchSpec)
// тоже самое, что
erlang:trace_pattern({Module, Function, '_'}, MatchSpec, [])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:tp(Module, Function, Arity, MatchSpec)
//тоже самое, что
erlang:trace_pattern({Module, Function, Arity}, MatchSpec, [])
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">dbg:ctp/0,1,2,3, dbg:ctpg/0,1,2,3, dbg:ctpl/0,1,2,3</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Эти функции останавливают трассировку, запущенную предыдущими функциями:
</p>
<ul class="org-ul">
<li>dbg:ctpg останавливает, если запущено через dbg:tp
</li>
<li>dbg:ctpl останавливает, если запущено через dbg:tpl
</li>
<li>dbg:ctp останавливает, неважно как запущено
</li>
</ul>

<p>
Да, с остановкой трассировки намудрили. Мало того, что нужно совпадать по аргументам,
так еще нужно помнить, какой функцией трассировка запускалась :)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5">dbg:stop/0, dbg:stop_clean/0</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Вышеуказанные функции останавливают трассировку, но не отменяют установленные флаги.
</p>

<p>
<b>dbg:stop</b> останавливает все трассировки, сбрасывает все флаги, закрывает порты
(если был редирект событий трассировки в порты). Но не сбрасывает MatchSpec.
То есть, отменяет <b>erlang:trace</b> но не отменяет <b>erlang:trace_pattern</b>
</p>

<p>
<b>dbg:stop_clear</b> тоже самое, плюс отменяет <b>erlang:trace_pattern</b>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Перенаправление событий трассировки</h3>
<div class="outline-text-3" id="text-1-3">
<p>
По умолчанию события трассировки получает <b>tracer process</b>. Он их форматирует и выводит на консоль.
Но их можно перенаправить в кастомную функцию, в файл, или на другую ноду.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">В кастомную функцию</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-Erlang">dbg:tracer(process , {HandlerFun, Data})
</pre>
</div>

<p>
Так можно задать кастомную функцию. Она должна получать 2 аргумента &#x2013; событие трассировки
и аккумулятор. Аргумент <b>Data</b> &#x2013; начальное значение аккумулятора. Функция возвращает
новое значение аккумулятора.
</p>

<p>
Таким образом можно организовать накопление некоторых данных в
аккумуляторе. Что может пригодится, например, для анализа работы
сборщика мусора, если трассируются события, связанный с его работой.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">В файл</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Сперва нужно получить ссылку на port function.
</p>

<div class="org-src-container">

<pre class="src src-Erlang">PortFun = dbg:trace_port(file, FileOptions)
</pre>
</div>

<p>
<b>FileOptions</b> могут быть разными (см документацию).
Например <b>{FileName, wrap, FileSuffix}</b> задает ротацию в файлах, аналогично, как ротируются логи.
</p>

<p>
Затем вызываем
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:tracer(port, PortFun)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">На другую ноду</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Направить события в порт несколько сложнее. Сперва нужно получить ссылку на port function.
</p>

<div class="org-src-container">

<pre class="src src-Erlang">PortFun = dbg:trace_port(ip, Port)
</pre>
</div>

<p>
Где <b>Port</b> &#x2013; это номер порта или кортеж <b>{PortNumber, QueueSize}</b>.
</p>

<p>
Затем вызываем
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:tracer(port, PortFun)
</pre>
</div>

<p>
Опция <b>QueueSize</b> позволяет ограничить количество сообщений, которые хранятся в буфере.
Это полезно, если клиент не успевает их забирать. Лишние события будут просто игнорироваться.
</p>

<p>
На другой ноде нужно вызывать
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:trace_client(ip, Arg, {HandlerFun, Data})
</pre>
</div>

<p>
Где <b>Arg</b> это номер порта или кортеж <b>{HostName, PortNumber}</b>
</p>

<p>
Такой клиент будет получать события из порта и обрабатывать их кастомной функцией.
</p>
</div>
</div>
</div>
