post/trace_dbg.org
** Match Specifications

Мощный, но сложный инструмент. Это аргумент для *erlang:trace_pattern* или *dbg:tp*,
позволяющий трассировать функцию не при каждом ее вызове, а в зависимости от ее аргументов.

Match Specification -- это DSL, миниязык внутри Erlang,
использующийся в *trace_pattern* и в *ets:select*.

http://www.erlang.org/doc/apps/erts/match_spec.html

Сам по себе имеет не очень читаемый синтаксис. К счастью, есть удобная обертка.

*dbg:fun2ms(LiteralFun) -> MatchSpec*

Так можно написать некий литерал, похожий на локальную функцию,
который преобразуется в настоящий MatchSpec.

Например, мы хотим трассировать функцию только если вторым аргументом приходит
кортеж, тегированный атомом error. Вот такой: *{error, Msg}*

Литерал мы напишем так:

fun([_, {error, _}]) -> true end

Из него получим MatchSpec

dbg:fun2ms(fun([_, {error, _}]) -> true end).
[{['_',{error,'_'}],[],[true]}]

(Вот как он выглядит :)

И дальше используем его для трассировки:

MatchSpec = dbg:fun2ms(fun([_, {error, _}]) -> true end),
dbg:tp(my_module, my_function, MatchSpec)

То есть, просто матчить входящие аргументы на какие-то конкретные значения не сложно.

Кстати, эти аргументы еще можно ограничивать гардами:

fun([Counter, {error, _}]) when Counter > 10 ->
    true
end

Но MatchSpec умеет больше. В теле *LiteralFun* можно добавлять специальные конструкции,
которые выглядят как вызовы функций. Они будут генерировать дополнительные события.

*return_trace()*

fun([_, {error, _}]) ->
    return_trace(),
    true
end

Генерирует событие со значением, возвращаемым из трассируемой функции.


*exception_trace()*

fun([_, {error, _}]) ->
    exception_trace(),
    true
end

Если при выполнении трассируемой функции возникает исключение,
генерирует событие, содержашее инфу о нем.


*display(Data)*

fun([_, {error, Msg}]) ->
    display(Msg),
    true
end

Дает побочный эффект, вывод *Msg* на консоль.


*message(Data)*

fun([_, {error, Msg}]) ->
    message(Msg),
    true
end

Генерирует событие, содержащее значение *Msg*.


*caller()*

fun([_, {error, _}]) ->
    message(caller()),
    true
end

Позволяет узнать, откуда была вызвана трассируемая функция.
Возвращает кортеж {Module, Function, Arity},
который можно передать в событии с помощью message()


*process_dump()*

fun([_, {error, _}]) ->
    message(process_dump()),
    true
end

Возвращает стэк процесса, форматированный в строку.


*self()*

fun([_, {error, _}]) ->
    message(self()),
    true
end

Возвращает Pid процесса, в котором выполняется трассируемая функция.

Есть еще несколько таких псевдо-функций, см документацию.


** sys

http://www.erlang.org/doc/man/sys.html

Про этот модуль я упоминал раньше, когда рассказывал про gen_server
http://yzh44yzh.by/post/gen_server.html#sec-4
Тут кратко повторюсь.

Этот модуль дает дополнительные средства отладки для процессов, которые являются
OTP-процессами (запускаются супервизором в рамках OTP-приложения).

Можно просматривать все сообщения, которые проходят через gen_server, и как
при этом меняется его состояние. Можно посмотреть статистику работы процесса:
время старта, к-во сообщений полученных и отправленных, инфа от планировщика.
Можно получить, и даже заменить состояние процесса.

Вся информация выводится на консоль. Ее можно направить в файл, но не в
кастомную функцию, и не в сокет.


** recon

У Фреда Хеберта есть проект [[http://ferd.github.io/recon/][recon]], дающий инструменты для мониторинга и диагностики
продакшен нод. Я думаю, мы про этот проект еще поговорим :)

А сейчас только про часть этого проекта -- модуль [[http://ferd.github.io/recon/recon_trace.html][recon_trace]].

Это обертка над *dbg*, дающая некоторые важные фичи.
И самая важная среди них -- безопасность отладки.

*recon_trace* ограничивает число обрабатываемых событий трассировки, и
позволяет избежать больших нагрузок на *io*.
Можно задавать либо просто лимит получаемых сообщений, либо лимит в еденицу времени.
tracing process связан с процессом консоли, так что при закрытии консоли
трассировка отключается автоматически. То же самое происходит при удаленной
отладке при потере связи с нодой.

*recon_trace* еще больше упрощает интерфейс отладки. Здесь нет необходимости
вызвать пару *dbg:p / dbp:tpl* (*erlang:trace / erlang:trace_pattern*).
Достаточно указать только trace_pattern, и трассировка по умолчанию запускается
для всех процессов. Но можно явно указать процессы, если это нужно.

Библиотека концентрируется на отладке функций, и пока не поддерживает
отладку сообщений. Второе не так важно для OTP-приложений, где
сообщения сводятся к вызовам функций *gen_server:call/cast* и
*gen_server:handle_call/handle_cast*.
