post/trace_dbg.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Match Specifications</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Мощный, но сложный инструмент. Это аргумент для <b>erlang:trace_pattern</b> или <b>dbg:tp</b>,
позволяющий трассировать функцию не при каждом ее вызове, а в зависимости от ее аргументов.
</p>

<p>
Match Specification &#x2013; это DSL, миниязык внутри Erlang,
использующийся в <b>trace_pattern</b> и в <b>ets:select</b>.
</p>

<p>
<a href="http://www.erlang.org/doc/apps/erts/match_spec.html">http://www.erlang.org/doc/apps/erts/match_spec.html</a>
</p>

<p>
Сам по себе имеет не очень читаемый синтаксис. К счастью, есть удобная обертка.
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:fun2ms(LiteralFun) -&gt; MatchSpec
</pre>
</div>

<p>
Так можно написать некий литерал, похожий на локальную функцию,
который преобразуется в настоящий MatchSpec.
</p>

<p>
Например, мы хотим трассировать функцию только если вторым аргументом приходит
кортеж, тегированный атомом error. Вот такой: <b>{error, Msg}</b>
</p>

<p>
Литерал мы напишем так:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt; true end
</pre>
</div>

<p>
Из него получим MatchSpec
</p>

<div class="org-src-container">

<pre class="src src-Erlang">dbg:fun2ms(fun([_, {error, _}]) -&gt; true end).
[{['_',{error,'_'}],[],[true]}] // Вот как он выглядит :)
</pre>
</div>

<p>
И дальше используем его для трассировки:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">MatchSpec = dbg:fun2ms(fun([_, {error, _}]) -&gt; true end),
dbg:tp(my_module, my_function, MatchSpec)
</pre>
</div>

<p>
То есть, просто матчить входящие аргументы на какие-то конкретные значения не сложно.
</p>

<p>
Кстати, эти аргументы еще можно ограничивать гардами:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([Counter, {error, _}]) when Counter &gt; 10 -&gt;
    true
end
</pre>
</div>

<p>
Но MatchSpec умеет больше. В теле <b>LiteralFun</b> можно добавлять специальные конструкции,
которые выглядят как вызовы функций. Они будут генерировать дополнительные события.
</p>

<p>
<b>return_trace()</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt;
    return_trace(),
    true
end
</pre>
</div>
<p>
Генерирует событие со значением, возвращаемым из трассируемой функции.
</p>


<p>
<b>exception_trace()</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt;
    exception_trace(),
    true
end
</pre>
</div>
<p>
Если при выполнении трассируемой функции возникает исключение,
генерирует событие, содержащее инфу о нем.
</p>


<p>
<b>display(Data)</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, Msg}]) -&gt;
    display(Msg),
    true
end
</pre>
</div>
<p>
Дает побочный эффект, вывод <b>Msg</b> на консоль.
</p>


<p>
<b>message(Data)</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, Msg}]) -&gt;
    message(Msg),
    true
end
</pre>
</div>

<p>
Генерирует событие, содержащее значение <b>Msg</b>.
</p>


<p>
<b>caller()</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt;
    message(caller()),
    true
end
</pre>
</div>

<p>
Позволяет узнать, откуда была вызвана трассируемая функция.
Возвращает кортеж {Module, Function, Arity},
который можно передать в событии с помощью message()
</p>


<p>
<b>process_dump()</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt;
    message(process_dump()),
    true
end
</pre>
</div>
<p>
Возвращает стэк процесса, форматированный в строку.
</p>


<p>
<b>self()</b>
</p>

<div class="org-src-container">

<pre class="src src-Erlang">fun([_, {error, _}]) -&gt;
    message(self()),
    true
end
</pre>
</div>
<p>
Возвращает Pid процесса, в котором выполняется трассируемая функция.
</p>

<p>
Есть еще несколько таких псевдо-функций, см документацию.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">sys</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="http://www.erlang.org/doc/man/sys.html">http://www.erlang.org/doc/man/sys.html</a>
</p>

<p>
Про этот модуль я упоминал раньше, когда рассказывал про gen_server
<a href="http://yzh44yzh.by/post/gen_server.html#sec-4">http://yzh44yzh.by/post/gen_server.html#sec-4</a>
Тут кратко повторюсь.
</p>

<p>
Этот модуль дает дополнительные средства отладки для процессов, которые являются
OTP-процессами (запускаются супервизором в рамках OTP-приложения).
</p>

<p>
Можно просматривать все сообщения, которые проходят через gen_server, и как
при этом меняется его состояние. Можно посмотреть статистику работы процесса:
время старта, к-во сообщений полученных и отправленных, инфа от планировщика.
Можно получить, и даже заменить состояние процесса.
</p>

<p>
Вся информация выводится на консоль. Ее можно направить в файл, но не в
кастомную функцию, и не в сокет.
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">recon</h3>
<div class="outline-text-3" id="text-1-6">
<p>
У Фреда Хеберта есть проект <a href="http://ferd.github.io/recon/">recon</a>, дающий инструменты для мониторинга и диагностики
продакшен нод. Я думаю, мы про этот проект еще поговорим :)
</p>

<p>
А сейчас только про часть этого проекта &#x2013; модуль <a href="http://ferd.github.io/recon/recon_trace.html">recon_trace</a>.
</p>

<p>
Это обертка над <b>dbg</b>, дающая некоторые важные фичи.
И самая важная среди них &#x2013; безопасность отладки.
</p>

<p>
<b>recon_trace</b> ограничивает число обрабатываемых событий трассировки, и
позволяет избежать больших нагрузок на <b>io</b>.
Можно задавать либо просто лимит получаемых сообщений, либо лимит в единицу времени.
tracing process связан с процессом консоли, так что при закрытии консоли
трассировка отключается автоматически. То же самое происходит при удаленной
отладке при потере связи с нодой.
</p>

<p>
<b>recon_trace</b> еще больше упрощает интерфейс отладки. Здесь нет необходимости
вызвать пару <b>dbg:p / dbp:tpl</b> (<b>erlang:trace / erlang:trace_pattern</b>).
Достаточно указать только trace_pattern, и трассировка по умолчанию запускается
для всех процессов. Но можно явно указать процессы, если это нужно.
</p>

<p>
Библиотека концентрируется на отладке функций, и пока не поддерживает
отладку сообщений. Второе не так важно для OTP-приложений, где
сообщения сводятся к вызовам функций <b>gen_server:call/cast</b> и
<b>gen_server:handle_call/handle_cast</b>.

<div id="disqus_thread"></div>
<script type="text/javascript">
var disqus_shortname = 'yzh44yzh';

(function() {
var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>
